perf/recovery.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    multi-node:
      target: 'http://localhost:5556'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-multi-node"
        
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 30
    - name: Plain
      duration: 30
      arrivalRate: 30
    - name: Ramp
      duration: 30
      arrivalRate: 30
      rampTo: 100
    - name: Plain
      duration: 60
      arrivalRate: 100
    - name: Recovery
      duration: 60
      arrivalRate: 30
    
scenarios:
  - name: HeavyLoad (/heavyLoad)
    flow:
      - get:
          url: '/heavyLoad/'