perf/workers.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    bbox-1:
      target: 'http://localhost:9090'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox-2"
    bbox-2:
      target: 'http://localhost:9091'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox-1"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 20
      arrivalRate: 1
    - name: Plain
      duration: 20
      arrivalRate: 5
    - name: Plain
      duration: 20
      arrivalRate: 6
    - name: Plain
      duration: 30
      arrivalRate: 7
    - name: Plain
      duration: 20
      arrivalRate: 8
    - name: Plain
      duration: 20
      arrivalRate: 9
    - name: Plain
      duration: 20
      arrivalRate: 1
    

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/bbox-sync'